"""
1) Перейдите в домашнюю папку по абсолютному пути (не используя ~)
"""
# cd .
"""
2) Объявите 2 переменные. Первой присвойте числовое значение, второй строчное. Размножьте строку при помощи второй переменной.
"""
a = ()
b = ()

"""
3) Объявите три переменные с целочисленными значениями x, y, z. Затем обменяйте их значения в одно действие. Переменной x присвойте значение переменной y. Переменной z присвойте значение переменной x. А переменной у присвойте значение переменной z.
"""
# писать код здесь

"""
4) Объявите строку и проведите следующие операции:  
  1)выведите последний символ этой строки.  
  2)распечатайте последние 2 символа. 
  3)переверните строку и распечатайте результат.  
  4)выведите длину объявленной строки.

"""
# писать код здесь

"""
5) Дана строка "The quick brown fox jumps over the lazy dog", замените все встречающиеся буквы "o" символом "*"
"""
# писать код здесь

"""
6)  Даны несколько хэштегов, разделённых символом '#'. Разделите их в отдельные строки. Например: #makers#bootcamp#программирование#it#курсы -> ['makers', 'bootcamp', 'программирование', 'it', 'курсы']
"""
# писать код здесь

"""
7) Запросите у пользователя ввод его имени, фамилии, возраста и города, в котором он проживает. С помощью f-строк выведите краткую информацию о нём, например: "Вас зовут Иван Пупкин, Ваш возраст: 35, Вы проживаете в городе Москва"
"""
# писать код здесь

"""
8) Проверить введенное пользователем число на то больше ли это число 5, если больше вывести “True”, меньше “False”.
"""
# писать код здесь

"""
9) Проверить введенные пользователем данные, если длина строки больше или равна 5 символам вывести “True”, если меньше 'False'.
"""
# писать код здесь

"""
10)  Проверить введенное пользователем число если оно отрицательное то вывести “negative”, если положительное то “positive”, если оно равно 0 то вывести “Zero”
"""
# писать код здесь

"""
11) Посчитайте возраст собаки в собачьих годах. Введите возраст в человеческих годах, переведите в собачьи и распечатайте. Формула перевода следующая: Первые 2 года жизни равны 10.5 собачьих лет. Далее каждый год равен 4 годам.
"""
# писать код здесь

"""
12) Шахматная ладья ходит по горизонтали или вертикали. Даны две различные клетки шахматной доски, определите, может ли ладья попасть с первой клетки на вторую одним ходом. Программа получает на входе четыре числа от 1 до 8 каждое, задающие номер столбца и номер строки сначала для первой клетки, потом для второй клетки. Программа должна вывести YES, если из первой клетки ходом ладьи можно попасть во вторую или NO в противном случае.
"""
# писать код здесь
